package day04;

public class Ex10_Homework {

	public static void main(String[] args) {
		
		/*
		 * UpDown 게임 참고
		 * 메뉴
		 * 1. UpDown 게임 실행
		 * 2. 최고 기록 확인 - 몇 번만에 맞췄는지 최고기록 하나만
		 * 3. 프로그램 종료
		 * 메뉴 선택 : 2
		 * 게임을 실행한 적이 없습니다.
		 * 메뉴
		 * 1. UpDown 게임 실행
		 * 2. 최고 기록 확인
		 * 3. 프로그램 종료		 * 
		 * 메뉴선택 : 1
		 * 입력 : 50
		 * Down!
		 * 입력 : 25
		 * 정답!
		 * 메뉴
		 * 1. UpDown 게임 실행
		 * 2. 최고 기록 확인
		 * 3. 프로그램 종료
		 * 메뉴선택 : 2
		 * 2회
		 * 메뉴로 가려면 엔터를 입력하세요.
		 * 메뉴
		 * 1. UpDown 게임 실행
		 * 2. 최고 기록 확인
		 * 3. 프로그램 종료
		 * 메뉴선택 : 3
		 * 프로그램을 종료합니다.
		 */
	}

}
